## Plan Result (roles - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 3 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.jenkins_read[&#34;jenkins-cftptl-intsvc-mi&#34;]
  * azurerm_role_assignment.jenkins_read[&#34;jenkins-cftsbox-intsvc-mi&#34;]
  * azurerm_role_assignment.jenkins_read[&#34;jenkins-ptl-mi&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.jenkins_read["jenkins-cftptl-intsvc-mi"] must be replaced
-/+ resource "azurerm_role_assignment" "jenkins_read" {
      ~ id                                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/providers/Microsoft.Authorization/roleAssignments/9c234a72-2e25-ce4f-d3bb-68bf31647538" -> (known after apply)
      ~ name                                   = "9c234a72-2e25-ce4f-d3bb-68bf31647538" -> (known after apply)
      ~ principal_id                           = "ca6d5085-485a-417d-8480-c3cefa29df31" -> "/servicePrincipals/ca6d5085-485a-417d-8480-c3cefa29df31" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.jenkins_read["jenkins-cftsbox-intsvc-mi"] must be replaced
-/+ resource "azurerm_role_assignment" "jenkins_read" {
      ~ id                                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/providers/Microsoft.Authorization/roleAssignments/5f50c8bc-d94b-e756-25b5-e5e174510617" -> (known after apply)
      ~ name                                   = "5f50c8bc-d94b-e756-25b5-e5e174510617" -> (known after apply)
      ~ principal_id                           = "0292f26e-288e-4f5b-85fc-b99a53f0a2b1" -> "/servicePrincipals/0292f26e-288e-4f5b-85fc-b99a53f0a2b1" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.jenkins_read["jenkins-ptl-mi"] must be replaced
-/+ resource "azurerm_role_assignment" "jenkins_read" {
      ~ id                                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/providers/Microsoft.Authorization/roleAssignments/eae658ce-0908-d66b-391d-d79af402122e" -> (known after apply)
      ~ name                                   = "eae658ce-0908-d66b-391d-d79af402122e" -> (known after apply)
      ~ principal_id                           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> "/servicePrincipals/7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"","Target":"roles - TerraformPlanApply","Vars":{}} -->